УТ_для_edt/src/ExchangePlans/смартОбменRoistat/смартОбменRoistat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="00364554-ee6d-40d5-bc92-c504d8ab5b7d">
  <name>смартОбменRoistat</name>
  <comment>#Б-1534 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Узел обмена, очередь выгрузки, регистрация данных</comment>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RoistatProject</name>
    <comment>#Б-1530 смарт: Лопато 04.12.2024 //Интеграция с ROIStat. Подготовительные работы и авторизация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРегламентногоЗадания</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

УТ_для_edt/src/ExchangePlans/смартОбменRoistat/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////
//                                                           //
//  ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ								//
//                                                         //
////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииСозданииНаСервере(ТекущийОбъект = НеОпределено)
	
	Если НЕ ТекущийОбъект = Неопределено Тогда
		
		УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект);
		
		Возврат;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере(ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНадписьРасписанияОбмена();   
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Проверка уникальности имени
	Если ЗначениеЗаполнено(ПланыОбмена.смартОбменRoistat.НайтиПоНаименованию(ТекущийОбъект.Наименование, Истина)) 
		И НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		
		Сообщить("Уже существует настройка с таким именем. Сохранение невозможно.");	

		Отказ = Истина;

		Возврат;
		
	КонецЕсли;
	
	//Активация регламентного задания
	Если ТекущийОбъект.ИспользоватьРегламентныеЗадания Тогда

		УстановитьПривилегированныйРежим(Истина);

		Если ТекущийОбъект.Код <> "" Тогда
			
			Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
			
			Если Задание = Неопределено Тогда
				
				Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("смартЗаданиеОбменRoistat");
				Задание.Использование = Истина;
				Задание.Ключ = Строка(Новый УникальныйИдентификатор);
				Задание.Наименование = ТекущийОбъект.Наименование;
				
				ТекущийОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
				
			КонецЕсли;
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(ТекущийОбъект.Код);
			
			Задание.Параметры = ПараметрыЗадания;
			Задание.Расписание = РасписаниеРегламентногоЗадания;
			
			Задание.Записать();
			
		Иначе
			Сообщить("Код настройки не прописался в регламентном задании. Необходимо переуказать регламентное задание настройку обмена");	
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.URL) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "URL не указан. Сохранить настройку нельзя.";
		Сообщение.Поле = "URL";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.RoistatProject) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Project не указан. Сохранить настройку нельзя.";
		Сообщение.Поле = "RoistatProject";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
		
	Если ЭтаФорма.Модифицированность тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры), 
					   "Изменения не будут сохранены. Продолжить закрытие?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Закрыть();	
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПоРаботеСРегламентнымиЗаданиями

////////////////////////////////////////////////////////////////
//                                                           //
//  ПРОЦЕДУРЫ И ФУНКЦИИ ПО РАБОТЕ С РЕГЛАМЕНТНЫМИ ЗАДАНИЯМИ //
//                                                         //
////////////////////////////////////////////////////////////


&НаСервере
Процедура УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект)
	
	Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
	
	Если НЕ Задание = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Задание.Расписание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользоватьРегламентныеЗадания()
	
	УстановитьДоступностьРасписанияОбмена();
	
	Если Объект.ИспользоватьРегламентныеЗадания Тогда
		
		ВыполнитьНастройкуРасписанияОбмена();
		УстановитьНадписьРасписанияОбмена();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбмена.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРасписанияОбмена()
	
	Элементы.НастроитьРасписаниеОбмена.Доступность = Объект.ИспользоватьРегламентныеЗадания;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписаниеLongPulling", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписаниеLongPulling(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	ВыполнитьНастройкуРасписанияОбмена();
	УстановитьНадписьРасписанияОбмена();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыВыполненияОбмена

////////////////////////////////////////////////////////////////
//                                                           //
//  ПРОЦЕДУРЫ ВЫПОЛНЕНИЯ ОБМЕНА								//
//                                                         //
////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВыполнитьОбменДанными(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохраненииНастройкиОбменаДанных", ЭтаФорма, Параметры), "Настройка обмена изменена и не записана. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗапускОбменаИнтерактивно(Объект.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохраненииНастройкиОбменаДанных(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
				
		Если НЕ Записать() Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗапускОбменаИнтерактивно(Объект.Ссылка);
	
    КонецЕсли;

КонецПроцедуры

#Область ПрочиеФункцииИПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаКлиенте
Процедура ЗапускОбменаИнтерактивно(УзелОбмена)
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("УзелОбмена", УзелОбмена);
	
	ЗапускОбменаИнтерактивноНаСервере(ПараметрыОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ЗапускОбменаИнтерактивноНаСервере(ПараметрыОбмена)
	
	смартИнтеграцияRoistat.ВыполнитьЗаданиеОбменRoistat(ПараметрыОбмена);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
